app/Controllers/Agences.php

UPDATE `agences` SET `agence_nom` = 'SC MICRO', `agence_nom_normalise` = 'scmicro', `agence_sigle` = 'SCM', `agence_tel` = '02 98 21 57 69', `agence_email` = 'contact@sc-micro.com', `agence_adresse1` = '25 Rue Herve de Guebriant', `agence_adresse2` = '', `agence_code_postal` = '29800', `agence_ville` = 'LANDERNEAU', `agence_horaires` = 'Lundi-vendredi 9h-12h 14h-18h30. Samedi 10h-12h 14h-17h', `agence_etat` = 0
WHERE `agences`.`agence_id` IN ('1')
---
                'agence_etat' => $retourne,
            );

            $model->update($AgenceID, $data);

DELETE FROM `agences`
WHERE `agence_id` IN ('1')
---
    public function supprimer_une_agence($AgenceID = NULL)
    {
        $model = new AgencesModel();
        $model->delete(['agence_id' => $AgenceID]);