app/Controllers/Utilisateurs.php

INSERT INTO `utilisateurs` (`agence_id`, `utilisateur_login`, `utilisateur_pseudo`, `utilisateur_email`, `utilisateur_pass_hash`, `utilisateur_token_mfa`, `utilisateur_token_mfa_datetime_generation`, `utilisateur_tel1`, `utilisateur_tel2`, `utilisateur_date_derniere_activite`, `utilisateur_statut_blocage`, `utilisateur_niveau_acces`) VALUES ('2', 'scmicro.test', 'Test', 'test@gmail.com', '$2y$10$FzFqu932BxBFKSLs1RopAOc1sXl9ZrcX5yoPqem0M0wgEo1jG9b1.', 589028, '2022-07-06 11:10:45', '', '', '2022-07-06 10:55:45', 0, 2)
---
                'utilisateur_niveau_acces' => 2
            ];
            $modelUtilisateurs = new UtilisateursModel();
            $modelUtilisateurs->insert($data);

UPDATE `utilisateurs` SET `utilisateur_pass_hash` = '$2y$10$Mm0zY3JavPLMZHk0eVDiN.h1oFUUTHWfzGG4PSkKBK0sJIJy27/cC'
WHERE `utilisateurs`.`utilisateur_id` IN ('4')
---
                        'utilisateur_pass_hash' => $hash,
                    ];

                    $modelUtilisateurs->update($UtilisateurID, $data); // on met à jour dans la base de donnée