app/Models/AgencesModel.php

SELECT *
FROM `agences`
WHERE `agence_id` = '1'
 LIMIT 1
---
    public function retournerAgences($AgenceID = false)
    {
        if ($AgenceID === false) // pas de n° d'agences en paramètre, on retourne toutes les agences
        {
            return $this->findAll(); // SELECT * FROM agences