app/Models/UtilisateursModel.php

SELECT *
FROM `utilisateurs`
JOIN `agences` ON `utilisateurs`.`agence_id` = `agences`.`agence_id`
---
    public function retournerUtilisateurs()
    {
        $builder = $this->db->table('utilisateurs');
        $builder->join('agences', 'utilisateurs.agence_id = agences.agence_id');
        $query = $builder->get();

SELECT *
FROM `utilisateurs`
JOIN `agences` ON `utilisateurs`.`agence_id` = `agences`.`agence_id`
WHERE `utilisateur_id` = '4'
---
    public function retournerParametreUtilisateur($UtilisateurID)
    {
        $builder = $this->db->table('utilisateurs');
        $builder->join('agences', 'utilisateurs.agence_id = agences.agence_id');
        $builder->where('utilisateur_id', $UtilisateurID);
        $query = $builder->get();

SELECT `utilisateur_pass_hash`, `utilisateur_login`
FROM `utilisateurs`
WHERE `utilisateur_id` = '4'
---
    public function retournerMotdepasse($UtilisateurID)
    {
        $builder = $this->db->table('utilisateurs');
        $builder->select('utilisateur_pass_hash, utilisateur_login');
        $builder->where('utilisateur_id', $UtilisateurID);
        $query = $builder->get();